Can't create Curtain Wall Mullion. The portion of the curtain grid it was placed on no longer exists.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCreateMullionReferenceNoGeometry { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCreateMullionReferenceNoGeometry As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCreateMullionReferenceNoGeometry {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CreationFailures Class
  Autodesk.Revit.DB Namespace